import { images } from "../assets/images";

interface ProductItem {
  id: number;
  image: string;
  item: string;
  title: string;
  oldMoney: string;
  newMoney: string;
  sale: string;
  type?: string;
}

interface NewsItem {
  img: string;
  title: string;
  description: string;
  date: string;
}


interface SideBarItem {
  name: string;
  obj: (string | string[] | { obj: string[][] })[];
}


export const sideBar: SideBarItem[] = [
  {
    name: "Вентиляция",
    obj: ["Вентиляторы", "Воздуховоды", "Люки и дверцы"],
  },
  {
    name: "Водо-газоснабжение",
    obj: [
      "Баки для воды",
      "Водосчетчики",
      "Газовые счетчики",
      "Запорная арматура и доборные элементы",

      "Канализационные трубы и фитинги",

      "Манометры",
      "Насосы",

      "Поплавки для ёмкости",
      "Станции водоснабжения",
      "Термометры",
      "Трубы полиэтиленовые вода,газ",
      "Фитинги полиэтиленовые вода,газ",
      {
        obj: [
          [
            "Асбокартон",
            "Вентиля",
            "Вставки диэлектрические",
            "Группа безопасности, редуктора давления ",
            "Заглушки запорные",
            "Задвижки, затворы ",
            "Запорная арматура прочие Клапаны ",
            "КТЗ Клапаны обратные",
            " Клапаны радиаторные",
            "Компенсаторы",
            "Контргайки",
            "Краны",
            "Лён",
            "Лента-фум",
            " Муфты",
            "Нить",
            "Отводы",
            "Паронит",
            "Переходы",
            "Подводка",
            "Прокладки рез. и поронит ",
            "Резьбы",
            "Сантехгель",
            "Сгоны",
            "Тройники",
            "Удлинители",
            "Фильтры чугунные ",
            "Фланцы",
            "Хомуты",
            "Штуцеры",
            "Эл.соединение Энергофлекс",
          ],
          ["Канализационные трубы ", "Фитинги для канализационных труб"],
          [
            "Блоки автоматики",
            "Насосы вибрационные",
            "Насосы дренажные",
            "Насосы канализационные",
            "Насосы поверхностные",
            "Насосы скважинные",
            "Насосы фекальные",
            "Насосы циркуляционные",
          ],
        ],
      },
    ],
  },
  {
    name: "Всё для сауны и бани",
    obj: [
      "Аксессуары для бани",
      "Двери, окна и бондарные изделия",
      "Комплектующие к дымоходам",
      "Печи банные",
    ],
  },
  {
    name: "Инструмент",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Листовой материал",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Метизные,такелажные и скобяные изделия",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Общестроительные материалы",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Отделочные материалы",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Отопление",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Сантехника",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Сварочное оборудование",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Спецодежда и средства индивидуальной и пожарной защиты",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Столярные изделия",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Сухие смеси",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Товары для дома, сада и огорода",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Утеплители и шумоизоляция",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
  {
    name: "Электротовары",
    obj: [
      "Ручной инструмент",
      "Строительное оборудование",
      "Штукатурно-отделочные инструменты",
      "Электроинструмент",
    ],
  },
];

const {
  dataImage,
  dataImage1,
  dataImage2,
  dataImage3,
  dataImage4,
  dataImage5,
  dataImage6,
  dataImage7,
  dataImage8,
  dataImage9,
  dataImage10,
  dataImage11,
  dataImage12,
  dataImage13,
  dataImage14,
  dataImage15,
  dataImage16,
  dataImage17,
  dataImage18,
  dataImage19,
  dataImage20,
  dataImage21,
  dataImage22,
  dataImage23,
  dataImage24
} = images;

const { mapCard1, mapCard2, newsImage1, newsImage2, newsImage3, newsImage4, } = images;


export let data: ProductItem[] = [
  {
    id: 1,
    image: dataImage,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 2,
    image: dataImage1,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 3,
    image: dataImage2,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 4,
    image: dataImage3,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 5,
    image: dataImage4,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 6,
    image: dataImage5,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 7,
    image: dataImage6,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 8,
    image: dataImage7,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 9,
    image: dataImage8,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 10,
    image: dataImage9,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 11,
    image: dataImage10,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 12,
    image: dataImage11,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 13,
    image: dataImage12,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 14,
    image: dataImage13,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 15,
    image: dataImage14,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 16,
    image: dataImage15,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 17,
    image: dataImage16,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 18,
    image: dataImage17,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 19,
    image: dataImage18,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 20,
    image: dataImage19,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 21,
    image: dataImage20,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 22,
    image: dataImage21,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 23,
    image: dataImage22,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 24,
    image: dataImage23,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
  {
    id: 25,
    image: dataImage24,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%"
  },
];

export const cardData: ProductItem[] = [
  {
    id: 1,
    image: dataImage,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%",
    type: "Инструменты"
  },
  {
    id: 2,
    image: dataImage1,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%",
    type: "Сантехника"
  },
  {
    id: 3,
    image: dataImage2,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%",
    type: "Для дома"
  },
  {
    id: 4,
    image: dataImage3,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%",
    type: "Для сада"
  },
  {
    id: 5,
    image: dataImage4,
    item: "Артикул: XJ89YHGO",
    title: "Перфоратор универсальный Wander X645-46 GF 1450W",
    oldMoney: "15 999 ₽",
    newMoney: "12 789 ₽",
    sale: "-15%",
    type: "Инструменты"
  },
];

export const cardList = [
  "МИР",
  "VISA International",
  "Mastercard Worldwide",
  "JCB"
];

export const paymentMethods = [
  "Банковской картой с помощью платежной системы на сайте или на кассе при получении заказа.",
  "Наличными на кассе при получении заказа",
  "При получении заказа просим Вас внимательно осмотреть товар, проверить его на предмет наличия внешних дефектов и комплектацию."
];

export const creditRequirements = [
  "Гражданство: Российская Федерация",
  "Возраст на момент предоставления кредита: не менее 21 года.",
  "Возраст на момент возврата кредита по договору: не более 70 лет.",
  "Использование сервисов Банка: держатель дебетовой банковской карты, выпущенной Банком, заключивший с Банком Договор банковского обслуживания, а также подключившийся к услуге “Мобильный банк” и системе СберБанк Онлайн.",
  "Регистрация: наличие постоянной(временной) регистрации по месту жительства/пребывания на территории Российской Федерации."
];

export const creditTerms = [
  "Без первоначального взноса.",
  "Срок действия кредита: от 3 до 36 месяцев.",
  "Сумма кредита от 3000 до 300 000 руб."
];

export const purchaseSteps = [
  'Выберите на сайте товар, нажмите “Добавить в корзину”, далее перейдите на страницу “Корзина”, щелкнув по ее значку в полосе верхнего меню.',
  'На странице “Корзина” нажмите кнопку “Оформить заказ”.',
  'В блоке “Оплата” выберете способ оплаты “Покупай со Сбером” (оформление покупки в кредит).',
  'Заполните все обязательные поля, отмеченные знаком “*”.',
  'Когда откроется СберБанк Онлайн, авторизуйтесь и заполните заявку. Рассмотрение заявки займет не более 2-х минут.',
  'Если кредит одобрен, деньги за покупку автоматически будут перечислены на счет ООО “Стройоптторг”.',
  'Далее Вы выбираете комфортный способ и время доставки или самовывоза.'
];

export const data2: NewsItem[] = [
  {
    img: mapCard1,
    title: "Электронная карта скидок!",
    description: "Теперь совершать покупки в ООО«Стройоптторг» стало еще удобнее! Для Вашего удобства мы запускаем электронную карту скидок.",
    date: "21 ноября 2023",
  },
  {
    img: mapCard2,
    title: "Хватит мечтать, пора покупать!",
    description: "Кредит от ОТП БАНК Получайте товар сразу, а платите — потом. Как оформить онлайн заявку в интернет магазине через “ОТП“",
    date: "21 ноября 2023",
  },
  {
    img: newsImage3,
    title: "Как выбрать электродрель: Практическое руководство для...",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "3 октября 2023",
  },
  {
    img: newsImage3,
    title: "Масштабное обновление каталога инструментов15",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage1,
    title: "Масштабное обновление каталога инструментов16",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage4,
    title: "Масштабное обновление каталога инструментов14",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage2,
    title: "Масштабное обновление каталога инструментов13",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage1,
    title: "Масштабное обновление каталога инструментов17",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage3,
    title: "Масштабное обновление каталога инструментов12",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage4,
    title: "Масштабное обновление каталога инструментов11",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage2,
    title: "Масштабное обновление каталога инструментов10",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  },
  {
    img: newsImage1,
    title: "Масштабное обновление каталога инструментов9",
    description:
      "С радостью сообщаем вам о крупном пополнении нашего каталога инструментов.",
    date: "1 октября 2023",
  }
];